In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

# pd.merge()

In [3]:
pd.merge(employees, departments, on = "DeptID") # Inner Join(Default)

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [4]:
pd.merge(employees, departments, on = "DeptID", how = "left") #Left Join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [5]:
pd.merge(employees, departments, on = "DeptID", how = "right") # Right Join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [6]:
pd.merge(employees, departments, on = "DeptID", how = "outer") # Outer Join

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

# Concatenating DataFrames

In [7]:
df1 = pd.DataFrame({"Name" : ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name" : ["Charlie", "David"]})

In [9]:
pd.concat([df1, df2]) # Vertical(rows)

      Name
0    Alice
1      Bob
0  Charlie
1    David

In [11]:
pd.concat([df1, df2], axis=1) # Horizontal(Columns)

    Name     Name
0  Alice  Charlie
1    Bob    David